In [1]:
import pandas as pd

## 예제 2-12 데이터를 읽어오기

In [2]:
ct = pd.read_csv("../data/2017_college_tuition.csv",encoding='euc-kr')

In [3]:
ct.head()

         학교명 설립구분   평균등록금
0    강릉원주대학교  국공립  4,262
1      강원대학교  국공립  4,116
2  경남과학기술대학교  국공립  3,771
3      경북대학교  국공립  4,351
4      경상대학교  국공립  3,967

In [4]:
ct.tail()

         학교명 설립구분   평균등록금
191    호남대학교   사립  6,482
192  호남신학대학교   사립  6,438
193    호서대학교   사립  7,695
194    호원대학교   사립  6,929
195    홍익대학교   사립  8,297

In [5]:
ct.shape

(196, 3)

In [6]:
ct.columns

Index(['학교명', '설립구분', '평균등록금'], dtype='object')

## 예제 2-13 대괄호를 이용한 일반 검색

In [7]:
ct_ser = ct['학교명']

In [8]:
ct_ser.head()

0      강릉원주대학교
1        강원대학교
2    경남과학기술대학교
3        경북대학교
4        경상대학교
Name: 학교명, dtype: object

In [9]:
ct_ser[100]

'부산장신대학교'

In [10]:
ct_ser.__getitem__(100)

'부산장신대학교'

In [11]:
ct.__getitem__('학교명').head()

0      강릉원주대학교
1        강원대학교
2    경남과학기술대학교
3        경북대학교
4        경상대학교
Name: 학교명, dtype: object

## 예제 2-14 대괄호를 이용한 슬라이스 검색

In [12]:
ct_ser[10:20]

10      금오공과대학교
11      대구교육대학교
12        목포대학교
13      목포해양대학교
14        부경대학교
15      부산교육대학교
16        부산대학교
17    서울과학기술대학교
18      서울교육대학교
19        서울대학교
Name: 학교명, dtype: object

In [13]:
ct_slice = ct[10:20]

In [14]:
ct_slice.head()

        학교명 설립구분   평균등록금
10  금오공과대학교  국공립  3,769
11  대구교육대학교  국공립  3,604
12    목포대학교  국공립  3,895
13  목포해양대학교  국공립  3,424
14    부경대학교  국공립  4,042

In [15]:
ct_slice.shape

(10, 3)

In [16]:
ct.__getitem__(slice(10,20)).head()

        학교명 설립구분   평균등록금
10  금오공과대학교  국공립  3,769
11  대구교육대학교  국공립  3,604
12    목포대학교  국공립  3,895
13  목포해양대학교  국공립  3,424
14    부경대학교  국공립  4,042

## 예제 2-15 논리식 검색

In [17]:
sat = pd.read_csv("../data/2014_korea_sat_scores.csv",encoding='euc-kr').dropna(axis=1)

In [18]:
sat.head()

   등급     과목 구분점수  도수(명)  비율(%)
0   1  국어 A형  128  13866   4.30
1   2  국어 A형  123  23599   7.32
2   3  국어 A형  116  42470  13.17
3   4  국어 A형  108  52640  16.32
4   5  국어 A형   97  63896  19.81

In [19]:
sat.shape

(342, 5)

In [20]:
sat['도수(명)'].dtype

dtype('int64')

In [21]:
import numpy as np

In [22]:
sat['도수(명)'] = sat['도수(명)'].astype(np.int64)

In [23]:
sat['도수(명)'].dtype

dtype('int64')

In [24]:
(sat['도수(명)'] < 20000).head()

0     True
1    False
2    False
3    False
4    False
Name: 도수(명), dtype: bool

In [25]:
sat[sat['도수(명)'] < 20000].head()

    등급     과목  구분점수  도수(명)  비율(%)
0    1  국어 A형   128  13866   4.30
8    9  국어 A형  60미만  12554   3.89
9    1  국어 B형   127  12615   4.45
16   8  국어 B형    59  19943   7.03
17   9  국어 B형  59미만  10868   3.83

## 예제 2-16  다중 논리식 검색

In [26]:
l_sat = ((sat['도수(명)'] < 20000) & (sat['비율(%)'] <= 5.0))

In [27]:
l_sat.shape

(342,)

In [28]:
l_sat.sum()

71

In [29]:
sat_logic = sat[l_sat]

In [30]:
sat_logic.shape

(71, 5)

In [31]:
sat_logic.head()

    등급     과목  구분점수  도수(명)  비율(%)
0    1  국어 A형   128  13866   4.30
8    9  국어 A형  60미만  12554   3.89
9    1  국어 B형   127  12615   4.45
17   9  국어 B형  59미만  10868   3.83
18   1  수학 A형   137  19675   4.77

## 예제 2-17 시리즈에 논리식 검색

In [32]:
sat_ser =  sat['도수(명)']

In [33]:
sat_ser.head()

0    13866
1    23599
2    42470
3    52640
4    63896
Name: 도수(명), dtype: int64

In [34]:
sat_ser[sat_ser < 20000].shape

(294,)

In [35]:
sat_ser[sat_ser < 20000].head()

0     13866
8     12554
9     12615
16    19943
17    10868
Name: 도수(명), dtype: int64

## 예제 2-18 데이터 프레임 팬시검색

In [36]:
import seaborn as sns

In [37]:
titanic = sns.load_dataset('titanic')

In [38]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [39]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [40]:
titanic[ ['age','sex','alive']] .head()

    age     sex alive
0  22.0    male    no
1  38.0  female   yes
2  26.0  female   yes
3  35.0  female   yes
4  35.0    male    no

In [41]:
titanic[ ['age','sex','alive']].isnull().sum()

age      177
sex        0
alive      0
dtype: int64

In [42]:
titanic[ ['age']].head()

    age
0  22.0
1  38.0
2  26.0
3  35.0
4  35.0

In [43]:
titanic['age'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

## 예제 2-19 시리즈 팬시검색

In [44]:
titanic_age = titanic['age']

In [45]:
titanic_age[[0,3,4]]

0    22.0
3    35.0
4    35.0
Name: age, dtype: float64

## 예제 2-20 명시적 인덱서 검색

In [46]:
import seaborn as sns

In [47]:
diamonds = sns.load_dataset('diamonds')

In [48]:
diamonds.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [49]:
diamonds.shape

(53940, 10)

In [50]:
diamonds.isnull().sum()

carat      0
cut        0
color      0
clarity    0
depth      0
table      0
price      0
x          0
y          0
z          0
dtype: int64

In [51]:
type(diamonds.loc)

pandas.core.indexing._LocIndexer

In [52]:
diamonds.loc[0]

carat       0.23
cut        Ideal
color          E
clarity      SI2
depth       61.5
table         55
price        326
x           3.95
y           3.98
z           2.43
Name: 0, dtype: object

In [53]:
diamonds.loc[0, 'carat']

0.23

In [54]:
diamonds.loc[:, 'carat'].head()

0    0.23
1    0.21
2    0.23
3    0.29
4    0.31
Name: carat, dtype: float64

In [55]:
diamonds['carat'].head()

0    0.23
1    0.21
2    0.23
3    0.29
4    0.31
Name: carat, dtype: float64

In [56]:
diamonds.loc[:, ['carat']].head()

   carat
0   0.23
1   0.21
2   0.23
3   0.29
4   0.31

In [57]:
diamonds[['carat']].head()

   carat
0   0.23
1   0.21
2   0.23
3   0.29
4   0.31

## 예제 2-21 암묵적 인덱서  검색

In [58]:
diamonds.iloc[0]

carat       0.23
cut        Ideal
color          E
clarity      SI2
depth       61.5
table         55
price        326
x           3.95
y           3.98
z           2.43
Name: 0, dtype: object

In [59]:
diamonds.iloc[0,0]

0.23

In [60]:
diamonds.iloc[0,[0]]

carat    0.23
Name: 0, dtype: object

In [61]:
diamonds.iloc[0,[0,1,2]]

carat     0.23
cut      Ideal
color        E
Name: 0, dtype: object

In [62]:
diamonds.iloc[:5, :3]

   carat      cut color
0   0.23    Ideal     E
1   0.21  Premium     E
2   0.23     Good     E
3   0.29  Premium     I
4   0.31     Good     J

## 예제 2-22 명시적 인덱서 복합 검색

In [63]:
diamonds.columns

Index(['carat', 'cut', 'color', 'clarity', 'depth', 'table', 'price', 'x', 'y',
       'z'],
      dtype='object')

In [64]:
((diamonds['carat']== 0.23) &(diamonds['cut'] == 'Very Good')).head()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [65]:
carat_cut = diamonds.loc[((diamonds['carat']== 0.23) & 
              (diamonds['cut'] == 'Very Good')), 
             ['carat', 'cut','color','price']]

In [66]:
carat_cut.shape

(197, 4)

In [67]:
carat_cut.head()

    carat        cut color  price
9    0.23  Very Good     H    338
21   0.23  Very Good     E    352
22   0.23  Very Good     H    353
25   0.23  Very Good     G    354
28   0.23  Very Good     D    357

In [68]:
diamonds.loc[:,['carat', 'cut','color','price']].head()

   carat      cut color  price
0   0.23    Ideal     E    326
1   0.21  Premium     E    326
2   0.23     Good     E    327
3   0.29  Premium     I    334
4   0.31     Good     J    335

In [69]:
diamonds.loc._get_slice_axis(slice(0,len(diamonds))).head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [70]:
abc = diamonds.loc._get_slice_axis(slice(0,len(diamonds)))
abc.__getitem__(['carat', 'cut','color','price']).head()

   carat      cut color  price
0   0.23    Ideal     E    326
1   0.21  Premium     E    326
2   0.23     Good     E    327
3   0.29  Premium     I    334
4   0.31     Good     J    335

## 예제 2-23 문자열 값 순서 검색

In [71]:
set_i = diamonds.set_index('color')

In [72]:
set_i.head()

       carat      cut clarity  depth  table  price     x     y     z
color
E       0.23    Ideal     SI2   61.5   55.0    326  3.95  3.98  2.43
E       0.21  Premium     SI1   59.8   61.0    326  3.89  3.84  2.31
E       0.23     Good     VS1   56.9   65.0    327  4.05  4.07  2.31
I       0.29  Premium     VS2   62.4   58.0    334  4.20  4.23  2.63
J       0.31     Good     SI2   63.3   58.0    335  4.34  4.35  2.75

In [73]:
try :
    set_i.loc['E':'F']
except ValueError as e :
    print('ValueError', e)
except KeyError as e :
    print(' KeyError', e)

 KeyError "Cannot get left slice bound for non-unique label: 'E'"

In [74]:
set_i.sort_index(inplace=True)

In [75]:
try :
    set_i_str = set_i.loc['E':'F']
except ValueError as e :
    print('ValueError', e)
except KeyError as e :
    print(' KeyError', e)

In [76]:
set_i_str.shape

(19339, 9)

In [77]:
set_i_str.head()

       carat        cut clarity  depth  table  price     x     y     z
color
E       2.01      Ideal     SI2   62.2   57.0  17849  8.09  8.04  5.02
E       1.51  Very Good    VVS2   60.2   61.0  17689  7.34  7.40  4.44
E       0.50      Ideal    VVS2   61.5   57.0   2236  5.09  5.12  3.14
E       1.13      Ideal    VVS1   60.6   57.0  14525  6.72  6.77  4.09
E       1.51      Ideal     VS2   62.7   57.0  14482  7.31  7.26  4.57

In [78]:
set_i_str.tail()

       carat      cut clarity  depth  table  price     x     y     z
color
F       1.01    Ideal     VS1   62.5   54.0   7602  6.46  6.43  4.03
F       1.01  Premium     VS1   62.5   58.0   7602  6.42  6.37  4.00
F       1.05    Ideal     VS2   59.1   57.0   7697  6.67  6.66  3.94
F       1.01     Good     VS2   57.3   62.0   5487  6.63  6.59  3.79
F       1.52    Ideal     SI1   62.0   54.0  12071  7.36  7.44  4.59